var LRS1 = 'Получены некорректные XML данные.';
var LRS2 = 'Отозвать документ?';
var LRS3 = 'Идет обработка запроса. Пожалуйста, подождите.';
var LRS3x = 'Проверка статуса документа...';
var LRS4 = 'Загрузка формы печати...';
var LRS4w = 'Загрузка формы просмотра...';
var LRS4v1 = 'Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка выполнения. Данные XSL формы просмотра некорректны).';
var LRS5 = 'Загрузка данных документов...';
var LRS6 = 'Обработка данных для печати...';
var LRS6x = 'Форматирование данных для печати...';
var LRS7 = 'Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка выполнения. Не удалось загрузить данные XML).';
var LRS8 = 'Документ успешно сохранен со статусом "';
var LRS8x = 'Документ %s успешно сохранен со статусом "';
var LRS8t = 'Шаблон документа успешно сохранен.';
var LRS9 = 'Отсутствует ответ сервера. Попробуйте повторить еще раз.';
var LRS10 = 'Получен неверный ответ сервера (не найден XML тег "reply").';
var LRS11 = 'Документ имеет недопустимый статус для выполнения операции.';
var LRS11P = 'Профиль имеет недопустимый статус для выполнения операции.';
var LRS12 = 'Вы действительно хотите покинуть страницу?\n\nДанные этой формы были изменены.\n\nНажмите OK, чтобы продолжить, или Отмена/Cancel, чтобы остаться на текущей странице.';
var LRS13 = 'Данные этой формы были изменены.';
var LRS14 = 'Количество отказываемых документов - ';
var LRS14t = 'Количество удаляемых записей - ';
var LRS15 = '. Отказать?';
var LRS15t = '. Удалить?';
var LRS16 = 'Второй аргумент, переданный в функцию MLWIN, не являющийся обьектом "window".';
var LRS17 = 'Доп. инфо';
var LRS18 = 'Скрыть';
var LRS19 = 'Модуль обработки сообщений';
var LRS20 = 'Произошел сбой в работе системы. Поступило некорректное (пустое) сообщение об ошибке.';
var LRS21 = 'Всего документов: ';
var LRS22 = 'На сумму: ';
var LRS23 = ' руб.';
var LRS24 = 'Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка выполнения. ';
var LRS25 = 'Изменения проведены успешно.';
var LRS26 = 'Не удалось выполнить операцию. Попробуйте переоткрыть документ и повторить операцию.';
var LRS27 = 'Укажите причину отказа:';
var LRS27c = 'Отказ документа';
var LRS27m = 'Укажите причину отказа!';
var LRS28 = 'Необходимо подтверждение для отправки документа в обработку';

var LRSTot1 = 'Отменить сделанные изменения?';
var LRSokp1 = 'Символ не допускается для ввода в это поле!';
var LRSokp2 = 'В этом поле допускаются только цифры от 0 до 9 !';
var LRSokp3 = 'Максимальная длина текста в этом поле ';
var LRSokp4 = ' символов.';
var LRSokp5 = 'В этом поле допускаются только латинские символы и знаки пунктуации!';
var LRSokp6 = 'В этом поле допускаются только заглавные латинские символы и знаки пунктуации!';
var LRSokp7 = 'В этом поле допускаются только символы SWIFT!';
var LRSSign1 = 'В обработку можно отправить только полностью подписанный документ';
var LRSSign2 = 'подписан';
var LRSscr1 = 'Для выполнения действия следует выделить строку и повторить операцию еще раз.';
var LRSscr2 = 'Загрузка страницы не завершена. \nДождитесь окончания загрузки и повторите действие.';
var LRSscr3 = 'В функцию ACTS передан неверный параметр ACTID: ';
var LRSscr4 = 'Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка выполнения. В XML данных не найден корневой элемент <DOCS>).';
var LRSscr5 = 'Параметры фильтра были изменены. До перехода по страницам Вам необходимо применить или отменить фильтр.';
var LRSscr6 = 'Для сортировки по нескольким полям следует нажать на заголовки полей в требуемом порядке, удерживая клавишу "Ctrl" в нажатом состоянии.';
var LRSfrm1 = '';
var LRSfrm2 = 'Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка выполнения. Отсутствует форма просмотра документа).';
var LRSfrm3 = 'Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка выполнения документа. В функцию ACTF передан неверный параметр ACTID).';
var LRSfrm4 = 'В функцию FILEATT передан неверный параметр ACTID: ';
var LRSfrm5 = 'В функцию fnOnFormSaveResult передан неверный параметр ACTID: ';
var LRSfrm6 = 'Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка выполнения документа. Процесс сохранения документа приостановлен).';
var LRSfrm7 = 'Процесс приостановлен.';
var LRSfrm9 = 'В функцию FORCE передан неверный параметр ACTID: ';
var LRSfrm10 = 'В функции FORCE неверно определен параметр для сохранения документа w.sig: ';
var LRSprn1 = 'Не удалось загрузить шаблон печатной формы. URL: ';
var LRSview1 = 'Не удалось загрузить шаблон формы просмотра. URL: ';
var LRSChecks1 = 'Неправильно указан';
var LRSChecks2 = '\"\n\nФормат ввода даты:  ДД.ММ.ГГГГ';
var LRSChecks3 = 'а дата:  \"';
var LRSChecks4 = 'Год должен быть больше 1996\n (Вы указали: ';
var LRSChecks5 = 'Вы явно что-то напутали... \nПо крайней мере, пока рано думать \nо столь далеком финансовом будущем. \nУкажите другой год.';
var LRSChecks6 = ' номер месяца:  \"';
var LRSChecks7 = 'о число:  \"';
var LRSChecks8 = 'В указанном месяце ';
var LRSChecks9 = ' день';
var LRSChecks10 = ' дней';
var LRSChecks11 = '';
var LRSChecks12 = 'Начальная дата запроса не может быть больше конечной';
var LRSChecks13 = 'Слишком большая сумма';
var LRSChecks14 = 'Количество символов в номере документа должно быть не больше ';

var
LRSCheX1="Неверно введены данные.",
LRSCheX2="Введен недопустимый символ(-ы).",
LRSCheX3="Превышена допустимая длина строки данных.",
LRSCheX4="Значение должно быть в интервале от -2147483648 до 2147483647.",
LRSCheX5="Введено слишком большое значение.",
LRSCheX11="Значение должно быть больше %s.",
LRSCheX12="Значение должно быть меньше %s.",
LRSCheX101="Неверно введено число.",
LRSCheX102="Неверно введён месяц.",
LRSCheX103="Неверно введён год.";

var LRSSig7 = 'Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка выполнения. Метод DealSignaturesEx вернул неизвестную\nмаску установленных подписей: ';
var LRSSig8 = 'Документ содержит недостаточное количество подписей и не будет отправлен в банк.';
var LRSSig9 = ' (в обработку)';
var LRSSig11 = 'Обработка подписанных документов...';
var LRSSig12 = 'Подписи не изменены.';
var LRSSig13 = 'Количество документов, переданных на подпись/снятие подписи: ';
var LRSSig14='Выполнена проверка Подписи под документом.';
var LRSSig14stm='Выполнена проверка Подписи под выпиской, содержащей выделенный документ.';
var LRSSig15='Подпись №';
var LRSSig16='Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка выполнения. Ошибка соответствия подписи и данных. Сообщение криптосистемы: ';
var LRSSig17='Опознанное название подписи: ';
var LRSSig18='Подпись и данные документа соответствуют друг другу.';
var LRSSig19='Проверяющий Абонент: ';
var LRSSig20='Ограничение: ';
var LRSSig21=' подписи';
var LRSSig22='единственной|первой|второй|визирующей';
var LRSSig23='Опознанный идентификатор подписи: ';
var LRSSig24='абонент имеет право ';
var LRSSig25='По установленной в документе подписи не удалось восстановить правомочность ее установки в документе. Идентификатор не найден в справочнике.';
var LRSSig26='Запрос на сертификат уже подписан.\nВы действительно хотите снять подпись?';
var LRSSig27='абонент не имеет права ';
var LRSSig28='Система Клиент-Банк будет работать в ограниченном режиме:[BR]<LI>Отсутствует право подписи документов.</LI>[BR]За дополнительной информацией, пожалуйста, обратитесь в службу поддержки Вашего банка.';
var LRSSig29='Подпись под документом не требуется. Для отправки документа в банк воспользуйтесь кнопкой "Отправить"';
var LRSSig30='Документ не содержит подписи визирующего абонента. Проверка подписи невозможна';
var LRSSig31='Нет возможности проверить ЭП в связи с отсутствием ключей, совместимых с СКЗИ, на которой выработана ЭП';
var LRSFrClDoc1 = 'Документ "Произвольный документ" можно подписать только после сохранения.\nДля этого перейдите в список "Новые".';
var LRSSig10='Отказать в визировании документу?';
var LRSSig40='Подписи акцепта/отказа документа';
var LRSSig41='Подтвердить акцепт/отказ документа?';
var LRSSig42='Операция невозможна.\nПодпись контрагента не подтверждена.';
var LRSSig43='ЭП не верна. Подтверждение акцепта невозможно.\nПодтвердить отказ документа?';
var LRSSig50='В связи с выполнением операции «Проверка подписи под документом»\nВам был отправлен банковский открытый ключ.\nДалее Вам будет предложено выбрать временный файл для сохранения этого ключа.';
var
LRSGen0='<B>Внимание!</B> Система обнаружила один или несколько криптографических профилей, не содержащих зарегистрированного сертификата, пригодного для использования.',
LRSGen1='Генерация ключа прошла успешно. После получения из Банка сертификата Вам необходимо связаться со службой Банка для подписания необходимых документов.',
LRSGen2='Для выбранного криптографического профиля уже создан запрос на сертификат, и отправлен в банк.\nДля генерации нового запроса на сертификат, пожалуйста, обратитесь в службу технической поддержки банка.\nДля завершения процесса выпуска сертификата Вам необходимо распечатать Акт признания открытого ключа\nи с полученным печатным документом лично обратиться в банк.',
LRSGen3='Печать Акта признания открытого ключа возможна только после успешной обработки запроса на сертификат и сохранении в БД Банка полученного из УЦ сертификата.',
LRSGen4='Текст ошибки:',
LRSGen5='Подтверждение получения отказа в регистрации отправлено в банк. Теперь Вы можете создать новый запрос.',
LRSGenSt0='запрос',
LRSGenSt1='[ запрос не создан ]',
LRSGenSt2='[ запрос принят ]',
LRSGenSt3='[ в эксплуатации ]';


var LRSMLCaption = 'Сообщение';
var LRSMLBtnCap = 'Закрыть';

var LRSShowDet = 'Показать детали';
var LRSHideDet = 'Скрыть детали';

var LRSShowFltr = 'Показать';
var LRSHideFltr = 'Скрыть';

var LRNoRecSC = 'Документы отсутствуют.';
var LRPrnStop = 'Печать остановлена. ';

var LRMonths='Январь,Февраль,Март,Апрель,Май,Июнь,Июль,Август,Сентябрь,Октябрь,Ноябрь,Декабрь';
var LRToday='сегодня';
var LRWeekDay='Пн,Вт,Ср,Чт,Пт,Сб,Вс';
var LRCnl='Отмена';

var LRSDsgn1='Изменения в настройках интерфейса не будут сохранены.';
var LRSDsgn2='Настройки успешно изменены.';
var A_LR1='Неверно введен логин. Введено менее 6 символов. Пожалуйста, повторите ввод.';
var A_LR2='Неверно введен пароль. Введено менее 6 символов. Пожалуйста, повторите ввод.';
var A_LR3='Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка получения ответа от сервера. ';
var A_LR4='Получен ответ неизвестного формата).';
var A_LR5='Получен разрушенный ответ ';
var A_LR6='Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка открытия сессии. ';
var A_LR7='Не удалось получить идентификатор сессии).';
var A_LR8='Произошел сбой в работе системы. Попробуйте повторить операцию еще раз. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка авторизации. ';
var A_LR9='Не удалось получить имя задачи).';
var A_LR10='Количество открытых сессий превысило допустимое значение, в связи с чем, в настоящее время выполнить вход в систему невозможно.\nЗакройте ранее открытые сессии и повторите вход или попробуйте подключиться к системе позднее.';
var A_LR11='\nВ случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка (Ошибка открытия сессии. Не удается закрыть ранее открытую сессию).';
var A_LR12='Неверно введен новый пароль. Введено менее 6 символов. Пожалуйста, повторите ввод.';
var A_A0='Неверно указан логин/пароль или учетная запись заблокирована.';
var A_A1='Введенный логин неверен. Повторите ввод. В случае неудачи, пожалуйста, обратитесь в службу поддержки Вашего банка.';
var A_A2='Введенный логин заблокирован. Пожалуйста, обратитесь в службу поддержки Вашего банка.';
var A_A3='Ошибка при получении хэш функции пароля';
var A_A4='Неверно введен пароль. Осталось попыток: ';
var A_A42='\nПомните, что латинские и русские символы, а также заглавные и прописные буквы при вводе пароля различаются.';
var A_A5='Введенный пароль заблокирован. Пожалуйста, обратитесь в службу поддержки Вашего банка.';
var A_A8='Количество попыток ввода пароля превысило допустимое значение. Ваш логин заблокирован. Пожалуйста, обратитесь в службу поддержки Вашего банка.';
var A_A9='Ошибка установки статуса авторизационной информации';
var A_A10='Системная ошибка сервера. Не удалось обработать запрос содержащий XML';
var A_A11='Сервер приложений не может обнаружить пользователя';
var A_A12='Срок действия пароля истек. Необходимо сменить пароль';
var A_A90='Извините, платежный сервис для Вас недоступен. Обратитесь в службу поддержки Вашего банка.';
var A_A200='Пароль изменён';
var A_A201='Неверно указан новый пароль';
var A_A202='Новый введенный пароль совпадает со старым';
var A_A204='Неверно указан новый пароль. Пароль включен в список «Запрещенных паролей» либо не удовлетворяет требованиям к безопасности. Пароль должен состоять из символов принадлежащих 3 из 4 групп символов: 1 - заглавные буквы, 2 -строчные буквы, 3 -цифры или 4 - специальные символы («$»,«&»,«*» и т.п. символы, не входящие в первые 3 группы)';
var A_A205='Длина пароля должна быть не менее %s символа(-ов)';
var A_A206='Новый введенный пароль уже использовался ранее, необходимо ввести другой пароль';
var A_A211='Не удалось изменить пароль';
var
A_AX1='Безопасная авторизация',
A_AX2='Безопасная смена пароля',
A_AX3='Использования системной клавиатуры возможно, НО небезопасно',
A_AX4='Далее',
A_AX5='Отмена',
A_AX11='Логин',
A_AX12='Пароль',
A_AX13='Введите старый пароль',
A_AX13a='Старый пароль',
A_AX14='Новый пароль',
A_AX15='Подтверждение нового пароля',
A_AX21='Новый пароль не подтвержден. Попробуйте ещё раз.';
var fil1='Активное подразделение Банка: ';
var SK_LR0='Неверно указан сеансовый ключ или учетная запись заблокирована.';
var SK_LR10='Неверно указан идентификатор комплекта/ключ активизации или учетная запись заблокирована.';
var SK_LR11='Не указан идентификатор комплекта или ключ активизации.';
var SK_LR12='Не указан ключ.';
var SK_LR30='Внимание! Был активизирован другой комплект № ';
var SK_LR30x='Введите новый сеансовый ключ № ';
var SK_LR0ack='Неверно указан сеансовый ключ.';
var SK_LR10ack='Неверно указан идентификатор комплекта/ключ активизации.';
var SK_LRsms='Необходимо запросить SMS-пароль.';
var SK_LR13sms='Неверно указан SMS-пароль.';

var
LRfs0='Состояние',
LRfs1='Новые',
LRfs2='Импортированные',
LRfs3='Подписанные',
LRfs4='В обработке',
LRfs5='Отказанные',
LRfs6='Завершенные',
LRfs7='Все документы',
LRfs8='Шаблоны',
LRfs9='Получение сертификата',
LRfs10='Избранное',
LRfs11='Ожидают визы',
LRfs12='Все запросы',
LRfs13='Акцептованные',
LRfs14='Исполненные',
LRfs15='Не исполненные',
LRfs50='Укажите имя фильтра',
LRfs51='Фильтр ',
LRfs52=' будет сохранён в справочнике фильтров.\nЕсли в справочнике существует фильтр с указанным именем, то он будет пересохранён.\nПродолжить?',
LRfs53=' будет удалён из справочника фильтров.\nПродолжить?',
LRfs54a='Фильтр с именем ', LRfs54b=' уже существует.',
LRfs55=' сохранён.',
LRfs56=' удалён.',
LRfs57=' сохранить не удалось.';


var
rcLR1='Переход к странице номер ',
rcLR2="Предыдущие страницы",
rcLR3="Следующие страницы",
rcLR4="Текущая страница",
rcLR5="Первая страница",
rcLR6="Предыдущая страница",
rcLR7="Следующая страница",
rcLR8="Последняя страница";

var
LRnoAXBt0='Далее',
LRnoAX0='Внимание! Загрузка ActiveX-компонента не была выполнена, в  связи с чем',
LRnoAX1=' вход в систему не может быть завершен.',
LRnoAX2=' система будет запущена в режиме ограниченной функциональности.'
				+'<BR>Вам будут недоступны следующие действия:'
				+'<BR>-     подпись документа, снятие подписи и визирование документа;'
				+'<BR>-     проверка подписи под документом;'
				+'<BR>-     получение и проверка квитанции банка на документ;'
				+'<BR>-     перегенерация комплекта ключей и настройка параметров ключевых носителей,'
				+'<BR>а также следующие функции системы:'
				+'<BR>-     функция слежения за суммарным объемом присоединенных файлов произвольного документа в банк;'
				+'<BR>-     функция отображения суммы прописью в печатных формах документов.',
LRnoAX3='Внимание! Загрузка криптографических компонентов не была выполнена или для Вас в системе не зарегистрировано ни одного ключа ЭП, в  связи с чем',
LRnoAX4='Вы можете воспользоваться сервисом «Выписка On-Line» для получения информации о движениях по Вашим счетам. Для входа в подсистему «Выписка On-Line» нажмите кнопку «'+LRnoAXBt0+'».',
LRnoAX9='Внимание! Не найдены криптографические компоненты системы или для Вас в системе не зарегистрировано ни одного ключа ЭП.',
LRnoAX10='Внимание! Система запущена в режиме ограниченной функциональности.',
LRnoAX11='Осуществить подписание документов или снятие подписи невозможно.',
LRnoAX12='Осуществить визирование документов невозможно.',
LRnoAX13='Осуществить проверку подписи невозможно.',
LRnoAX14='Осуществить получение и проверку квитанций банка на документ невозможно.',
LRnoAX15='Осуществить сохранение файла отчета, содержащего результат импорта, невозможно.',
LRnoAX16='Осуществить экспорт выписок в текстовые файлы невозможно.',
LRnoAX17='В печатной форме документа(ов) суммы прописью будут отсутствовать.',
LRnoAX18='Осуществить акцептование документов невозможно.',
LRnoSK0='Внимание! Использование криптографического функционала в данном сеансе ограничено. Для получения доступа к криптографическому функционалу в полном объеме необходимо пройти дополнительную аутентификацию при входе в систему.';

var
LRAObtn1='Просмотр',
LRAObtn2='Ок',
LRAObtn3='Отмена',
LRAOn1='Импорт документов из БС',
LRAOn2='Экспорт документов в БС',
LRAOn3='Экспорт выписки в RTF',
LRAOn4='Экспорт документа в RTF',
LRAOn5='Экспорт выписки в Excel',
LRAOb1='Идёт выполнение операции «',
LRAOb2='».',
LRAOe1='Выполнение операции «',
LRAOe2='» завершено.',
LRAOe3='» прерывается...',
LRAOe4='» было прервано пользователем.',
LRAOw1='В настоящее время запуск других операций невозможен.',
LRAOw2='Дождитесь завершения операции и повторите попытку.',
LRAOw3='Подтвердите завершение выполнения.',
LRAOw4='Не удалось сформировать данные.',
LRAOfile1='По запрошенным параметрам сформирован RTF-файл.',
LRAOfile2a='Чтобы сохранить полученный файл на локальный диск для дальнейшего использования, нажмите правой кнопкой мыши на ссылке ',
LRAOfile2b='заархивированный RTF-файл',
LRAOfile2c=' и выберите пункт "Save Target As.../Сохранить объект как..."',
LRAOfile3='По запрошенным параметрам сформирован файл Excel.',
LRAOfile3a='заархивированный файл Excel';

var
LRAtch1='Размер присоединенного файла не может быть больше ',
LRAtch2=' Кб',
LRAtch3='Выполнение данной операции приведет к потере только что присоединенных и не сохраненных файлов. Продолжить ?',
LRAtch4='Присоединенные файлы: ';

add_M('locres_russian');